<?php
$a = [
    'Московская область:' =>    ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область:' =>    ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область:' =>    [ 'Михайлов','Касимов','Новомичуринск','Кораблино'],
];

foreach($a as $b => $c){
  echo "$b <br>";
  $itog = '';
  if(is_array($c))
        {
            foreach($c as $y)
                if(mb_substr($y, 0, 1, 'UTF-8') == 'К')
                    $itog .= $y. ', ';
            echo ($itog);
        }
  echo "<hr>";
}
?>

